jMeter/jmeter.log
2025-12-30 10:58:58,558 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-30 10:58:58,623 INFO o.a.j.JMeter: Loading user properties from: C:\Users\91992\Downloads\apache-jmeter-5.6.3\bin\user.properties
2025-12-30 10:58:58,626 INFO o.a.j.JMeter: Loading system properties from: C:\Users\91992\Downloads\apache-jmeter-5.6.3\bin\system.properties
2025-12-30 10:58:58,627 INFO o.a.j.JMeter: Setting JMeter property: dataFile=jMeterReqCSV.csv
2025-12-30 10:58:58,627 INFO o.a.j.JMeter: Setting JMeter property: threads=3
2025-12-30 10:58:58,648 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-30 10:58:58,648 INFO o.a.j.JMeter: Version 5.6.3
2025-12-30 10:58:58,648 INFO o.a.j.JMeter: java.version=21
2025-12-30 10:58:58,648 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-12-30 10:58:58,649 INFO o.a.j.JMeter: os.name=Windows 10
2025-12-30 10:58:58,649 INFO o.a.j.JMeter: os.arch=amd64
2025-12-30 10:58:58,649 INFO o.a.j.JMeter: os.version=10.0
2025-12-30 10:58:58,649 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-12-30 10:58:58,649 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-30 10:58:58,650 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-30 10:58:58,650 INFO o.a.j.JMeter: Available Processors =4
2025-12-30 10:58:58,687 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-30 10:58:58,687 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-30 10:58:58,688 INFO o.a.j.JMeter: JMeterHome=C:\Users\91992\Downloads\apache-jmeter-5.6.3
2025-12-30 10:58:58,688 INFO o.a.j.JMeter: user.dir  =D:\python_notes\bankingSystem\JavaScriptCES
2025-12-30 10:58:58,688 INFO o.a.j.JMeter: PWD       =D:\python_notes\bankingSystem\JavaScriptCES
2025-12-30 10:58:58,705 INFO o.a.j.JMeter: IP: 192.168.56.1 Name: DESKTOP-GFBDJVL FullName: DESKTOP-GFBDJVL
2025-12-30 10:58:58,737 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'D:\python_notes\bankingSystem\JavaScriptCES\report'
2025-12-30 10:58:58,745 INFO o.a.j.s.FileServer: Default base='D:\python_notes\bankingSystem\JavaScriptCES'
2025-12-30 10:58:58,750 INFO o.a.j.s.FileServer: Set new base='D:\python_notes\bankingSystem\JavaScriptCES'
2025-12-30 10:58:59,601 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-30 10:58:59,757 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-30 10:58:59,773 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-30 10:58:59,789 INFO o.a.j.s.SaveService: Loading file: jMeterHttpReqDay2.jmx
2025-12-30 10:58:59,974 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-30 10:58:59,974 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-30 10:58:59,974 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-30 10:58:59,974 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-30 10:58:59,975 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-30 10:58:59,975 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-30 10:59:00,092 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-30 10:59:00,107 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2025-12-30 10:59:00,108 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: result.jtl
2025-12-30 10:59:00,108 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\Users\91992\Downloads\apache-jmeter-5.6.3\bin\reportgenerator.properties
2025-12-30 10:59:00,110 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2025-12-30 10:59:00,121 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2025-12-30 10:59:00,130 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2025-12-30 10:59:00,130 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2025-12-30 10:59:00,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2025-12-30 10:59:00,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2025-12-30 10:59:00,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2025-12-30 10:59:00,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2025-12-30 10:59:00,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2025-12-30 10:59:00,133 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2025-12-30 10:59:00,149 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,152 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,155 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,156 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,156 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,157 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,157 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,157 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,158 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,158 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-12-30 10:59:00,167 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2025-12-30 10:59:00,167 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2025-12-30 10:59:00,168 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2025-12-30 10:59:00,169 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2025-12-30 10:59:00,170 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2025-12-30 10:59:00,173 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2025-12-30 10:59:00,262 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-30 10:59:00,268 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-30 10:59:00,269 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-30 10:59:00,292 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-30 10:59:00,293 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-30 10:59:00,591 INFO o.a.j.JMeter: Running test (1767072540591)
2025-12-30 10:59:00,651 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2025-12-30 10:59:00,651 INFO o.a.j.e.StandardJMeterEngine: Starting 3 threads for group Thread Group.
2025-12-30 10:59:00,651 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-30 10:59:00,652 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=3 ramp-up=1 delayedStart=false
2025-12-30 10:59:00,665 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-30 10:59:00,665 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-30 10:59:00,803 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2025-12-30 10:59:00,808 INFO o.a.j.s.FileServer: Stored: D:/python_notes/bankingSystem/JavaScriptCES/jMeterReqCSV.csv Alias: D:/python_notes/bankingSystem/JavaScriptCES/jMeterReqCSV.csv@1657125852
2025-12-30 10:59:00,895 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-GFBDJVL
2025-12-30 10:59:00,916 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-30 10:59:00,920 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-30 10:59:00,921 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-30 10:59:00,921 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-30 10:59:00,921 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-30 10:59:01,128 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2025-12-30 10:59:01,266 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2025-12-30 10:59:01,267 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2025-12-30 10:59:01,271 INFO o.a.j.r.Summariser: summary +      1 in 00:00:01 =    1.5/s Avg:    82 Min:    82 Max:    82 Err:     0 (0.00%) Active: 1 Started: 2 Finished: 1
2025-12-30 10:59:01,272 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2025-12-30 10:59:01,272 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2025-12-30 10:59:01,458 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2025-12-30 10:59:01,466 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-3
2025-12-30 10:59:01,466 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2025-12-30 10:59:01,467 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-30 10:59:01,468 INFO o.a.j.s.FileServer: Close: D:/python_notes/bankingSystem/JavaScriptCES/jMeterReqCSV.csv@1657125852
2025-12-30 10:59:01,473 INFO o.a.j.r.Summariser: summary +      2 in 00:00:00 =    9.7/s Avg:    43 Min:     5 Max:    82 Err:     0 (0.00%) Active: 0 Started: 3 Finished: 3
2025-12-30 10:59:01,474 INFO o.a.j.r.Summariser: summary =      3 in 00:00:01 =    3.4/s Avg:    56 Min:     5 Max:    82 Err:     0 (0.00%)
2025-12-30 10:59:01,475 INFO o.a.j.JMeter: Generating Dashboard
2025-12-30 10:59:01,476 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2025-12-30 10:59:01,544 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2025-12-30 10:59:01,866 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2025-12-30 10:59:01,867 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2025-12-30 10:59:01,872 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2025-12-30 10:59:01,873 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2025-12-30 10:59:01,898 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2025-12-30 10:59:01,903 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2025-12-30 10:59:01,903 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2025-12-30 10:59:01,903 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2025-12-30 10:59:01,958 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2025-12-30 10:59:01,958 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2025-12-30 10:59:01,959 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2025-12-30 10:59:01,959 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2025-12-30 10:59:01,968 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2025-12-30 10:59:01,970 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 21 samples
2025-12-30 10:59:01,970 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2025-12-30 10:59:01,970 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2025-12-30 10:59:01,971 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2025-12-30 10:59:01,971 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2025-12-30 10:59:01,971 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2025-12-30 10:59:01,971 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2025-12-30 10:59:01,973 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2025-12-30 10:59:01,974 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2025-12-30 10:59:01,975 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2025-12-30 10:59:01,975 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2025-12-30 10:59:01,975 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 45 samples
2025-12-30 10:59:01,975 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 9 samples
2025-12-30 10:59:01,976 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 3 samples
2025-12-30 10:59:01,978 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 3 samples produced in 302ms on channel 0
2025-12-30 10:59:01,978 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2025-12-30 10:59:02,253 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2025-12-30 10:59:02,254 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2025-12-30 10:59:02,255 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2025-12-30 10:59:02,256 INFO o.a.j.r.d.JsonExporter: Checking output folder
2025-12-30 10:59:02,257 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to D:\python_notes\bankingSystem\JavaScriptCES\report\statistics.json
2025-12-30 10:59:02,400 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2025-12-30 10:59:02,409 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: D:\python_notes\bankingSystem\JavaScriptCES\report
2025-12-30 10:59:02,788 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: D:\python_notes\bankingSystem\JavaScriptCES\report, creating folder structure
2025-12-30 10:59:02,792 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\Users\91992\Downloads\apache-jmeter-5.6.3\bin\report-template' to 'D:\python_notes\bankingSystem\JavaScriptCES\report', got message: D:\python_notes\bankingSystem\JavaScriptCES\report, found non empty folder with following content [D:\python_notes\bankingSystem\JavaScriptCES\report\statistics.json], will be ignored
2025-12-30 10:59:03,860 INFO o.a.j.JMeter: Dashboard generated